tuanbaonguyen09/Lab1/EX9/STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define l1_Pin GPIO_PIN_4
#define l1_GPIO_Port GPIOA
#define l2_Pin GPIO_PIN_5
#define l2_GPIO_Port GPIOA
#define l3_Pin GPIO_PIN_6
#define l3_GPIO_Port GPIOA
#define l4_Pin GPIO_PIN_7
#define l4_GPIO_Port GPIOA
#define l5_Pin GPIO_PIN_8
#define l5_GPIO_Port GPIOA
#define l6_Pin GPIO_PIN_9
#define l6_GPIO_Port GPIOA
#define l7_Pin GPIO_PIN_10
#define l7_GPIO_Port GPIOA
#define l8_Pin GPIO_PIN_11
#define l8_GPIO_Port GPIOA
#define l9_Pin GPIO_PIN_12
#define l9_GPIO_Port GPIOA
#define l10_Pin GPIO_PIN_13
#define l10_GPIO_Port GPIOA
#define l11_Pin GPIO_PIN_14
#define l11_GPIO_Port GPIOA
#define l12_Pin GPIO_PIN_15
#define l12_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
